<template>
  <div id="body">
    <h1>关于 AiTodo
      <svg t="1670551687585"  class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="2668" width="40" height="40"><path d="M413.866667 853.333333c-14.933333 0-32-6.4-44.8-17.066666L61.866667 533.333333c-12.8-10.666667-19.2-25.6-19.2-42.666666s6.4-32 19.2-42.666667l110.933333-108.8c23.466667-23.466667 64-23.466667 87.466667 0L567.466667 640c12.8 10.666667 19.2 27.733333 19.2 42.666667 0 17.066667-6.4 32-19.2 42.666666l-110.933334 108.8c-10.666667 12.8-27.733333 19.2-42.666666 19.2z m-198.4-490.666666c-4.266667 0-10.666667 2.133333-14.933334 6.4l-110.933333 108.8c-2.133333 4.266667-4.266667 8.533333-4.266667 12.8s2.133333 8.533333 6.4 12.8l309.333334 300.8c8.533333 8.533333 19.2 8.533333 27.733333 0l110.933333-108.8c4.266667-4.266667 6.4-8.533333 6.4-12.8 0-4.266667-2.133333-8.533333-6.4-12.8L230.4 369.066667c-4.266667-4.266667-8.533333-6.4-14.933333-6.4z" p-id="2669" fill="#1296db"></path><path d="M413.866667 853.333333c-14.933333 0-32-6.4-44.8-17.066666l-110.933334-108.8c-12.8-10.666667-19.2-27.733333-19.2-42.666667 0-17.066667 6.4-32 19.2-42.666667L763.733333 145.066667c23.466667-23.466667 64-23.466667 87.466667 0l110.933333 108.8c12.8 10.666667 19.2 27.733333 19.2 42.666666s-6.4 32-19.2 42.666667L456.533333 836.266667c-10.666667 10.666667-27.733333 17.066667-42.666666 17.066666zM808.533333 170.666667c-4.266667 0-10.666667 2.133333-14.933333 6.4L288 669.866667c-4.266667 4.266667-6.4 8.533333-6.4 12.8 0 4.266667 2.133333 8.533333 6.4 12.8l110.933333 108.8c8.533333 8.533333 19.2 8.533333 27.733334 0l505.6-494.933334c4.266667-4.266667 6.4-8.533333 6.4-12.8s-2.133333-8.533333-6.4-12.8l-110.933334-108.8c-4.266667-2.133333-8.533333-4.266667-12.8-4.266666z" p-id="2670" fill="#1296db"></path></svg>
    </h1>
    <h3 style="color: red; font-weight: bold">所有的数据全程在本地浏览器处理存储<br>不会获取到你的任何信息</h3>
    <p>这个项目算是用来当期末作业使用的,花了大概合计10个小时不到</p>
    <p>原本打算做一个类似微软Todo的待办记录,加了一堆不切实际的功能</p>
    <p>结果测试发现各种问题,前后改了超过5版,跟我原来的项目大纲差别有点大了</p>
    <p>算了,能跑不报错就行</p>
    <br>
    <h1>项目详情</h1>
    <p>使用<a href="https://cn.vuejs.org/">Vue3</a>框架构建 & <a
        href="https://www.antdv.com/components/overview">ant-design-vue</a>作为UI组件库 & Typescript语言</p>
    <p>由<a href="https://vitejs.cn/">Vite</a>&<a href="https://www.jetbrains.com/idea/">IntelliJ IDEA</a>强力驱动</p>
    <br>
    <br>
    <h1 style="color: #5A7CC2; font-style: italic">Design by Chelly</h1>
    <p>©本项目在<a href="https://gitee.com/skyindex/ai-todo">Gitte</a>与<a href="https://github.com/sky-index/AiTodo">Github</a>使用MIT许可证完全开源
    </p>
  </div>
</template>


<script lang="ts">
export default {
  name: "About"
}
</script>

<style scoped>
#body {
  position: relative;
  z-index: 2;
  padding-top: 3%;
  padding-left: 10%;

  font-size: 16px;
  text-shadow: 1px 1px rgba(255, 255, 255, 0.3);
}
</style>